src/cfe/osn/DataProcessors/_РабочийСтолДоставка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>_РабочийСтолДоставка</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РаспоряженияВЗаданияхНаПеревозку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПолучательОтправительПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>203</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВремя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучательОтправитель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоставляетсяПолностью</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПоручениеЭкспедитору</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаДоставку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._ЗаявкаНаДоставку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cfe/osn/DataProcessors/_РабочийСтолДоставка/Forms/ФормаПредупреждения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка._РабочийСтолДоставка.МакетПредупреждение");
	
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	СостоянияИРеквизитыДоставки.Распоряжение КАК Распоряжение,
	//|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК Описание,
	//|	СостоянияИРеквизитыДоставки.ПолучательОтправитель КАК ПолучательОтправитель,
	//|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес
	//|ИЗ
	//|	РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	//|ГДЕ
	//|	СостоянияИРеквизитыДоставки.Распоряжение В(&Распоряжения)
	//|	И СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки = ИСТИНА
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СостоянияИРеквизитыДоставки.ПолучательОтправитель,
	//|	СостоянияИРеквизитыДоставки.Распоряжение";
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Распоряжения", Параметры.Распоряжения);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Отступ"));
	
	
	//Пока Выборка.Следующий() Цикл
	//	
	//	ЗаполняемаяОбласть = Макет.ПолучитьОбласть("СтрокаТаблицы");
	//	
	//	ТекстРаспоряжение = НСтр("ru = '%ПолучательОтправитель%, %Распоряжение%'");
	//	ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%ПолучательОтправитель%", Выборка.ПолучательОтправитель);
	//	ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%Распоряжение%", Выборка.Распоряжение);
	//	ЗаполняемаяОбласть.Параметры.ТекстРаспоряжение = ТекстРаспоряжение;
	//	ЗаполняемаяОбласть.Параметры.Заполнить(Выборка);
	//	
	//	ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
	//	
	//	
	//	
	//КонецЦикла;
	
	МассивРаспоряжений = Параметры.Распоряжения;
	Для Каждого Распоряжение Из МассивРаспоряжений Цикл
		
		ЗаполняемаяОбласть = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ТекстРаспоряжение = НСтр("ru = '%ПолучательОтправитель%, %Распоряжение%'");
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору")  Тогда
			
			Если ЗначениеЗаполнено(Распоряжение.ОсобыеУсловияПеревозкиОписание) Тогда
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%ПолучательОтправитель%", Распоряжение.Пункт);
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%Распоряжение%",Распоряжение.Ссылка);
				ЗаполняемаяОбласть.Параметры.Адрес = Распоряжение.АдресДоставки;
				ЗаполняемаяОбласть.Параметры.ТекстРаспоряжение = ТекстРаспоряжение;
				ЗаполняемаяОбласть.Параметры.Описание = Распоряжение.ОсобыеУсловияПеревозкиОписание;
				ЗаполняемаяОбласть.Параметры.Распоряжение = Распоряжение;
				ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			Если Распоряжение.ОсобыеУсловияПеревозки Тогда
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%ПолучательОтправитель%", Распоряжение.Партнер);
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%Распоряжение%",Распоряжение.Ссылка);
				ЗаполняемаяОбласть.Параметры.Адрес = Распоряжение.АдресДоставки;
				ЗаполняемаяОбласть.Параметры.ТекстРаспоряжение = ТекстРаспоряжение;
				ЗаполняемаяОбласть.Параметры.Описание = Распоряжение.ОсобыеУсловияПеревозкиОписание;
				ЗаполняемаяОбласть.Параметры.Распоряжение = Распоряжение;
				ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
			КонецЕсли; 
			
		ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка._ЗаявкаНаДоставку") Тогда
			
			Если Распоряжение.ОсобыеУсловияПеревозки Тогда
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%ПолучательОтправитель%", Распоряжение.Партнер);
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%Распоряжение%",Распоряжение.Ссылка);
				ЗаполняемаяОбласть.Параметры.Адрес = Распоряжение.АдресДоставки;
				ЗаполняемаяОбласть.Параметры.ТекстРаспоряжение = ТекстРаспоряжение;
				ЗаполняемаяОбласть.Параметры.Описание = Распоряжение.ОсобыеУсловияПеревозкиОписание;
				ЗаполняемаяОбласть.Параметры.Распоряжение = Распоряжение;
				ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
			КонецЕсли;
				
		КонецЕсли
		
	КонецЦикла;		// Распоряжения Из МассивРаспоряжений 
		
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	
КонецПроцедуры

#КонецОбласти
